results/blogPost/benchclient1/quarkus-worker-pool-48000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 152.555ms, rate sampling interval: 922ms
  Thread calibration: mean lat.: 161.842ms, rate sampling interval: 949ms
  Thread calibration: mean lat.: 164.794ms, rate sampling interval: 933ms
  Thread calibration: mean lat.: 155.012ms, rate sampling interval: 918ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.27s     1.68s    9.93s    85.40%
    Req/Sec    11.55k   322.34    12.28k    64.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  380.42ms
 75.000%    2.11s 
 90.000%    3.49s 
 99.000%    7.63s 
 99.900%    9.35s 
 99.990%    9.85s 
 99.999%    9.91s 
100.000%    9.94s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.163     0.000000            1         1.00
      32.175     0.100000       230411         1.11
      53.919     0.200000       460766         1.25
     104.447     0.300000       690997         1.43
     200.959     0.400000       921453         1.67
     380.415     0.500000      1151571         2.00
     593.407     0.550000      1266774         2.22
     944.639     0.600000      1381923         2.50
    1340.415     0.650000      1497156         2.86
    1699.839     0.700000      1612177         3.33
    2105.343     0.750000      1727316         4.00
    2285.567     0.775000      1785101         4.44
    2486.271     0.800000      1842786         5.00
    2707.455     0.825000      1900084         5.71
    2924.543     0.850000      1957876         6.67
    3166.207     0.875000      2015420         8.00
    3305.471     0.887500      2043980         8.89
    3489.791     0.900000      2072821        10.00
    3690.495     0.912500      2101600        11.43
    3915.775     0.925000      2130459        13.33
    4188.159     0.937500      2159102        16.00
    4362.239     0.943750      2173534        17.78
    4562.943     0.950000      2187854        20.00
    4800.511     0.956250      2202351        22.86
    5140.479     0.962500      2216673        26.67
    5619.711     0.968750      2231144        32.00
    5873.663     0.971875      2238307        35.56
    6131.711     0.975000      2245494        40.00
    6393.855     0.978125      2252635        45.71
    6684.671     0.981250      2259833        53.33
    7008.255     0.984375      2267048        64.00
    7172.095     0.985938      2270701        71.11
    7340.031     0.987500      2274273        80.00
    7520.255     0.989062      2277821        91.43
    7716.863     0.990625      2281432       106.67
    7954.431     0.992188      2285054       128.00
    8060.927     0.992969      2286872       142.22
    8163.327     0.993750      2288619       160.00
    8339.455     0.994531      2290469       182.86
    8486.911     0.995313      2292228       213.33
    8667.135     0.996094      2294027       256.00
    8749.055     0.996484      2294937       284.44
    8839.167     0.996875      2295806       320.00
    8937.471     0.997266      2296705       365.71
    9027.583     0.997656      2297662       426.67
    9134.079     0.998047      2298547       512.00
    9183.231     0.998242      2299015       568.89
    9224.191     0.998437      2299439       640.00
    9273.343     0.998633      2299879       731.43
    9314.303     0.998828      2300352       853.33
    9347.071     0.999023      2300754      1024.00
    9371.647     0.999121      2300989      1137.78
    9412.607     0.999219      2301237      1280.00
    9453.567     0.999316      2301454      1462.86
    9486.335     0.999414      2301665      1706.67
    9535.487     0.999512      2301890      2048.00
    9560.063     0.999561      2302012      2275.56
    9584.639     0.999609      2302122      2560.00
    9617.407     0.999658      2302235      2925.71
    9666.559     0.999707      2302359      3413.33
    9707.519     0.999756      2302440      4096.00
    9748.479     0.999780      2302497      4551.11
    9781.247     0.999805      2302565      5120.00
    9797.631     0.999829      2302615      5851.43
    9814.015     0.999854      2302676      6826.67
    9830.399     0.999878      2302731      8192.00
    9838.591     0.999890      2302756      9102.22
    9846.783     0.999902      2302781     10240.00
    9854.975     0.999915      2302818     11702.86
    9863.167     0.999927      2302850     13653.33
    9871.359     0.999939      2302881     16384.00
    9871.359     0.999945      2302881     18204.44
    9879.551     0.999951      2302899     20480.00
    9887.743     0.999957      2302927     23405.71
    9887.743     0.999963      2302927     27306.67
    9895.935     0.999969      2302954     32768.00
    9895.935     0.999973      2302954     36408.89
    9895.935     0.999976      2302954     40960.00
    9895.935     0.999979      2302954     46811.43
    9904.127     0.999982      2302970     54613.33
    9904.127     0.999985      2302970     65536.00
    9912.319     0.999986      2302986     72817.78
    9912.319     0.999988      2302986     81920.00
    9912.319     0.999989      2302986     93622.86
    9912.319     0.999991      2302986    109226.67
    9912.319     0.999992      2302986    131072.00
    9920.511     0.999993      2302993    145635.56
    9920.511     0.999994      2302993    163840.00
    9920.511     0.999995      2302993    187245.71
    9920.511     0.999995      2302993    218453.33
    9928.703     0.999996      2303001    262144.00
    9928.703     0.999997      2303001    291271.11
    9928.703     0.999997      2303001    327680.00
    9928.703     0.999997      2303001    374491.43
    9928.703     0.999998      2303001    436906.67
    9928.703     0.999998      2303001    524288.00
    9928.703     0.999998      2303001    582542.22
    9928.703     0.999998      2303001    655360.00
    9928.703     0.999999      2303001    748982.86
    9928.703     0.999999      2303001    873813.33
    9928.703     0.999999      2303001   1048576.00
    9928.703     0.999999      2303001   1165084.44
    9928.703     0.999999      2303001   1310720.00
    9928.703     0.999999      2303001   1497965.71
    9928.703     0.999999      2303001   1747626.67
    9928.703     1.000000      2303001   2097152.00
    9936.895     1.000000      2303002   2330168.89
    9936.895     1.000000      2303002          inf
#[Mean    =     1271.020, StdDeviation   =     1684.692]
#[Max     =     9928.704, Total count    =      2303002]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2770267 requests in 1.00m, 243.06MB read
Requests/sec:  46172.24
Transfer/sec:      4.05MB